tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'phinze/cask'

#basic 
cask 'firefox'
cask 'google-chrome'
cask 'skype'
cask 'lastpass'
cask 'kindle'
cask 'slack'

#development 
cask 'java'
brew 'pkg-config'
brew 'libyaml'
brew 'openssl'
brew 'ansible'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'gdbm'
brew 'gettext'
brew 'gitup'
brew 'gmp'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'libgpg-error'
brew 'libksba'
brew 'libtool'
brew 'mongodb'
brew 'node'
brew 'openconnect'
brew 'pcre'
brew 'perl'
brew 'readline'
brew 'python'
brew 'ruby'
brew 'sbt'
brew 'scala'
brew 'vim'
brew 'zsh'
brew 'fzf'
cask 'intellij-idea'
cask 'iterm2'
cask 'postman'
cask 'sublime-text'
cask 'vagrant'
cask 'virtualbox'
brew 'terraform'
brew 'tree'

#devops
#hashicorp
brew 'packer'
brew 'consul'
